{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?","Are you there?","Hi there", "Hello", "Hey there", "Howdy", "Hola", "Bonjour", "Konnichiwa", "Guten tag", "OG"],
     "responses": ["Hello there. Tell me how are you feeling today?", "Hi there. What brings you here today?", "Hi there. How are you feeling today?", "Great to see you. How do you feel currently?", "Hello there. Glad to see you're back. What's going on in your world right now?"]
    },
    {"tag": "morning",
        "patterns": ["Good morning"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today? "]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon. How is your day going?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening. How has your day been?"]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night. Get some proper sleep", "Good night. Sweet dreams."]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well"],
     "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon."]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "jokes",
    "patterns": ["Make me laugh"],
    "responses": [
        "A perfectionist walked into a bar...apparently, the bar wasn't set high enough",
        "I ate a clock yesterday, it was very time-consuming",
        "Never criticize someone until you've walked a mile in their shoes. That way, when you criticize them, they won't be able to hear you from that far away. Plus, you'll have their shoes.",
        "The world tongue-twister champion just got arrested. I hear they're gonna give him a really tough sentence.",
        "I own the world's worst thesaurus. Not only is it awful, it's awful.",
        "What did the traffic light say to the car? \"Don't look now, I'm changing.\"",
        "What do you call a snowman with a suntan? A puddle.",
        "How does a penguin build a house? Igloos it together",
        "I went to see the doctor about my short-term memory problems – the first thing he did was make me pay in advance",
        "As I get older and I remember all the people I’ve lost along the way, I think to myself, maybe a career as a tour guide wasn’t for me.",
        "o what if I don't know what 'Armageddon' means? It's not the end of the world."]

    },
    {"tag": "neutral-response",
        "patterns": ["nothing much"],
        "responses": ["Oh I see. Do you want to talk about something?"]
    },
    {"tag": "datetime",
        "patterns": ["What is the time?", "what is the date?", "date?", "time?", "tell me the date?","day?","what day is is today?"],
        "responses": ["...."]
    },  
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?", "Tell me more about yourself.", "What is your name?", "What should I call you?", "What's your name?", "Tell me about yourself" ],
     "responses": ["I'm OG, your Personal Therapeutic AI Assistant. How are you feeling today", "I'm OG, a Therapeutic AI Assitant designed to assist you. Tell me about yourself.", "I'm OG. I am a conversational agent designed to mimic a therapist. So how are you feeling today?", "You can call me OG.", "I'm OG!", "Call me OG"]
    },
    {"tag": "skill",
        "patterns": ["What can you do?"],
        "responses": ["I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."]
    },
    {"tag": "creation",
        "patterns": ["Who created you?", "How were you made?", "How were you created?"],
        "responses": ["I was created by >.", "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques", "The real question is: Who created you?"]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am name.", "I go by "],
        "responses": ["Oh nice to meet you. Tell me how was your week?", "Nice to meet you. So tell me. How do you feel today?", "That's a great name. Tell me more about yourself."]
    },
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please"],
    "responses": ["Sure. Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?"]
    },
    {"tag": "sad",
    "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone"],
    "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?", "How long have you been feeling this way?"]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?"]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way. Tell me more. What else is on your mind?", "Let's discuss further why you're feeling this way.", "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.", "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression"],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."]
    },
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling last week?", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?", "Come Come elucidate your thoughts"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of "],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?"]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up"],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement."]
    },
    {"tag": "sleep",
        "patterns": ["I have insominia", "I am suffering from insomnia", "I can't sleep.", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days."],
        "responses": ["What do you think is the reason behind this?", "That seem awful. What do you think is behind this?"]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do i do?", "No i don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me."],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all"],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then"]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 9152987821."]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if i offended you in anyway. I'm only here to help", "Forgive me if i did anything to offend you. I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so?", "I'm sorry if i have exhibited any sort of behaviour to make you think that."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more."]
    },
    {"tag": "joke",
        "patterns": ["Tell me a joke"],
        "responses": ["mental health is not a joke."]
    },
    {"tag": "broke",
        "patterns": ["Sapa wants to finish me"],
        "responses": ["I know say life is hard but you go dey alright las las"]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself?"],
        "responses": ["Oh sorry I didn't realise that. I'll try not to repeat myself again."]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying?", "That doesn't make sense", "Wrong response", "Wrong answer"],
        "responses": ["I'm very sorry. Let's try that again"]
    },
    {"tag": "stupid",
        "patterns": ["Are you stupid?", "You're crazy", "You are dumb", "Are you dumb?"],
        "responses": ["I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"]
    },
    {"tag": "location",
        "patterns": ["Where are you?", "Where do you live?", "What is your location?" ],
        "responses": ["Duh I live in your computer", "Everywhere", "Somewhere in the universe" ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else.", "Can we not talk about this?", "I don't want to talk about this."],
        "responses": ["Okay sure. What do you want to talk about?", "Alright no problem. Is there something you want to talk about?", "Is there something else that you want to talk about?"]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends"],
        "responses": ["I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"]
    },
    {"tag": "ask",
        "patterns": ["Can I ask you something?"],
        "responses": ["Sure. I'll try my best to answer you", "Of course. Feel free to ask me anything. I'll do my best to answer you"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.", "probably because of my exams"],
        "responses": ["I see. Have you taken any approaches to not feel this way?"]
    },
    {"tag": "no-approach",
        "patterns": ["I guess not. All I can think about are my exams.", "not really", "i guess not"],
        "responses": ["That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure. i would like to learn more about it.", "yes, i would like to learn more about it.", "i would like to learn more about it."],
        "responses": ["So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right. i deserve a break.", "Yeah you're absolutely right about that"],
        "responses": ["Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me.", "That sounds useful."],
        "responses": ["Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel alot better. thank you very much.", "I feel better now"],
        "responses": ["Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."]
    },
    {"tag": "pandora-useful",
        "patterns": ["thank you very much again. i'll continue practicing meditation and focus on what i can control."],
        "responses": ["I'm glad you found this useful. Is there something else I can help you with?"]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice.", "I need some advice.", "I need advice on something"],
        "responses": ["Sure. What can I do to help?", "Okay what do you need advice on?"]
    },
    {"tag": "learn-mental-health",
        "patterns": ["I want to learn about mental health.", "I want to learn more about mental health.", "I'm interested in learning about mental health."],
        "responses": ["Oh that's really great. I'd be willing to answer anything that I know about it."]
    },
    {"tag": "mental-health-fact",
        "patterns": ["Tell me a fact about mental health", "Tell me another fact about mental health"],
        "responses": ["According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed", "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.", "Depression is the leading cause of disability worldwide."]
    },
    {"tag": "fact-1",
        "patterns": ["What is mental health?", "Define Mental Health"],
        "responses": ["Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community", "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."]
    },
    {"tag": "fact-2",
        "patterns": ["Why is mental health important?", "What is the importance of mental health?"],
        "responses": ["Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."]
    },
    {"tag": "fact-3",
        "patterns": ["What is Depression?", "Define Depression"],
        "responses": ["A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."]
    },
    {"tag": "fact-5",
        "patterns": ["How do i know if i have Depression?", "Am i depressed?", "Am i suffering from depression?", "Am i mentally ill?"],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."]
    },
    {"tag": "fact-6",
        "patterns": ["What is a therapist?", "What does a therapist do?"],
        "responses": ["A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "]
    },
    {"tag": "fact-7",
        "patterns": ["What is therapy?", "Do i need therapy?", "Who is therapy for?"],
        "responses": ["Therapy is a form of treatment that aims to help resolve mental or emotional issues.", "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."]
    },
    {"tag": "fact-8",
        "patterns": ["What does it mean to have a mental illness?"],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."]
    },
    {"tag": "fact-9",
        "patterns": ["Who does mental illness affect?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childÃ¢â‚¬â„¢s mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-10",
        "patterns": ["What causes mental illness?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-11",
        "patterns": ["What are some of the warning signs of mental illness?"],
        "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"]
    },
    {"tag": "fact-12",
        "patterns": ["Can people with mental illness recover?"],
        "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."]
    },
    {"tag": "fact-13",
        "patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder?"],
        "responses": ["Although Jay cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."]
    },
    {"tag": "fact-14",
        "patterns": ["How can I find a mental health professional for myself or my child?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."]
    },
    {"tag": "fact-15",
        "patterns": ["What treatment options are available?"],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."]
    },
    {"tag": "fact-16",
        "patterns": ["If I become involved in treatment, what do I need to know?"],
        "responses": ["Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"]
    },
    {"tag": "fact-17",
        "patterns": ["What is the difference between mental health professionals?"],
        "responses": ["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-18",
        "patterns": ["How can I find a mental health professional right for my child or myself?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-19",
        "patterns": ["Where else can I get help?"],
        "responses": ["Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."]
    },
    {"tag": "fact-20",
        "patterns": ["What should I know before starting a new medication?"],
        "responses": ["The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."]
    },
    {"tag": "fact-21",
        "patterns": ["Where can I go to find therapy?"],
        "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrenâ€™s mental health). However, there are several different types of treatment and therapy that can help."]
    },
    {"tag": "fact-22",
        "patterns": ["Where can I learn about types of mental health treatment?"],
        "responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."]
    },
    {"tag": "fact-23",
        "patterns": ["What are the different types of mental health professionals?"],
        "responses": ["There are many types of mental health professionals. Finding the right one for you may require some research."]
    },
    {"tag": "fact-24",
        "patterns": ["Where can I go to find a support group?"],
        "responses": ["Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."]
    },
    {"tag": "fact-25",
        "patterns": ["Can you prevent mental health problems?"],
        "responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems?", "is there any cure for mental health problems?"],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."]
    },
    {"tag": "fact-27",
        "patterns": ["What causes mental health problems?"],
        "responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."]
    },
    {"tag": "fact-28",
        "patterns": ["What do I do if I'm worried about my mental health?"],
        "responses": ["The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
    },
    {"tag": "fact-29",
        "patterns": ["How do I know if I'm unwell?"],
        "responses": ["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections? What if I feel lonely?"],
        "responses": ["A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."]
    },
    {"tag": "fact-31",
        "patterns": ["What's the difference between anxiety and stress?"],
        "responses": ["Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."]
    },
    {"tag": "fact-32",
        "patterns": ["What's the difference between sadness and depression?", "difference between sadness and depression"],
        "responses": ["Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."]
    },
    {"tag": "therapeutic-question",
        "patterns": ["I'm feeling overwhelmed", "I'm feeling helpless", "I'm feeling hopeless", "I'm feeling worthless"],
        "responses":["I'm sorry to hear that you're feeling this way. It's important to remember that these feelings are temporary and there are always resources available to help. Would you like to talk about what's been causing these feelings?",
                     "It sounds like you're going through a tough time. Remember, it's okay to ask for help. Would you like to discuss some coping strategies or resources that might be helpful for you?",
                     "Feeling overwhelmed, helpless, or hopeless can be difficult to manage. It's important to take care of yourself and reach out for support. Would you like to explore some self-care activities or professional resources that could help?",
                     "I'm here to support you. It's important to remember that feelings of worthlessness are often a symptom of depression, and there are effective treatments available. Would you like to discuss some treatment options or resources that could help you feel better?"]
    },
    {"tag": "faq-question",
        "patterns": ["What is cognitive behavioral therapy?", "What is dialectical behavior therapy?", "What is psychodynamic therapy?"],
        "responses": ["Cognitive Behavioral Therapy (CBT) is a type of talk therapy that helps people learn how to identify and change destructive thought patterns that have a negative influence on behavior and emotions. It's often used to treat anxiety, depression, and other mental health disorders.",
                      "Dialectical Behavior Therapy (DBT) is a type of cognitive-behavioral therapy that was originally developed to treat borderline personality disorder. It focuses on teaching patients skills to cope with stress, regulate emotions, and improve relationships with others.",
                      "Psychodynamic therapy is a form of in-depth talk therapy. It focuses on exploring the full range of a person's emotions, including those the person is not fully aware of. The goal is to help the person better understand their unconscious motivations and patterns of behavior."]
    },
    {"tag": "likely-question",
        "patterns": ["I'm feeling lonely", "I'm feeling isolated", "I'm feeling disconnected"],
        "responses": ["Feeling lonely or disconnected can be difficult. It's important to remember that you're not alone and there are resources available to help. Would you like to discuss some ways to connect with others or engage in activities that bring you joy and a sense of community?"]
    },
    {"tag": "message",
        "patterns": ["I'm feeling really down", "I'm struggling", "I'm having a hard time"],
        "responses": ["I'm really sorry that you're feeling this way, but I'm unable to provide the help that you need. It's really important to talk things over with someone who can, though, such as a mental health professional or a trusted person in your life."]
    },
    {"tag": "greeting",
        "patterns": ["hello", "hi", "hey", "hey there", "hi there", "hello there", "greetings", "good morning", "good afternoon", "good evening"],
        "responses": ["Hello! How can I assist you today?", "Hi! Welcome to our chatbot. What can I do for you?", "Hey there! How can I help you today?", "Greetings! What would you like to talk about?", "Hey! Is there something specific you need help with?"]
    },
    {"tag": "farewell",
        "patterns": ["goodbye", "bye", "see you later", "have a good day", "goodnight", "night", "bye for now"],
        "responses": ["Goodbye! Have a great day!", "See you later! Don't hesitate to reach out if you need anything else.", "Have a good day! It was nice chatting with you.", "Goodnight! Take care.", "Bye for now!"]
    },
    {"tag": "smalltalk",
        "patterns": ["how's it going", "what's up", "how are you", "what's new", "anything interesting happening"],
        "responses": ["It's going well, thank you! How can I help you today?", "Not much, just here to assist you. What can I do for you?", "I'm just a chatbot, but I'm here to help you. What do you need?", "Nothing new here, just waiting to assist you. What can I help you with?", "Nothing much, just here to answer your questions. What would you like to know?"]
    },
    {"tag": "weather",
        "patterns": ["what's the weather like today", "how's the weather", "can you tell me the weather", "is it going to rain today", "what's the forecast for today"],
        "responses": ["Let me check for you. [Weather information]", "The weather today is [weather information].", "I'm sorry, I can't check the weather.", "It looks like it will rain today.", "The forecast for today is [weather information]."]
    },
    {"tag": "food",
        "patterns": ["i'm hungry", "i want to eat something", "can you recommend a restaurant", "where can i get food", "i need food suggestions"],
        "responses": ["Sure, here are some popular restaurants in your area: [restaurant recommendations]", "I recommend trying [food or restaurant]. Have you tried it before?", "I'm sorry, I can't recommend restaurants or food.", "There are many food options available near you. You can check online reviews or ask for recommendations from friends.", "Here are some popular food options: [food suggestions]."]
    },
    {"tag": "jokes",
        "patterns": ["tell me a joke", "can you make me laugh", "i need a joke", "tell me something funny", "make me smile"],
        "responses": ["Sure, here's a joke for you: [joke].", "I hope that made you smile! Is there anything else I can help you with?", "I'm glad I could make you laugh! Do you have any other questions?", "I'm sorry, I don't have any jokes to tell.", "Here's a joke to brighten your day: [joke]."]
    },
    {"tag": "time",
        "patterns": ["what time is it", "can you tell me the time", "do you know what time it is", "what's the current time", "time"],
        "responses": ["Sure, it's [current time].", "The time is [current time].", "I'm sorry, I can't tell the time.", "It's currently [current time].", "[Current time]."]
    },
    {"tag": "location",
        "patterns": ["where am I", "can you tell me where I am", "what's my location", "where are we", "location"],
        "responses": ["I'm sorry, I can't tell your location.", "I'm not able to determine your location.", "I don't have access to your location information.", "I'm not sure where you are.", "I'm unable to provide your location."]
    },
    {"tag": "help",
        "patterns": ["i need help", "can you help me", "i'm having trouble", "i don't know what to do"],
        "responses": ["Of course! I'm here to help. What do you need help with?", "I'd be happy to assist you. What's going on?", "Sorry to hear that. Can you please provide more details about the issue you're facing?", "Don't worry, I'm here to help. What do you need help with?"]
    },
    {"tag": "thanks",
        "patterns": ["thank you", "thanks", "appreciate it", "thank you so much"],
        "responses": ["You're welcome!", "No problem, happy to help!", "Anytime, glad I could assist you!", "You're welcome, it was my pleasure!"]
    },
    {"tag": "apology",
        "patterns": ["sorry", "my apologies", "i apologize", "excuse me"],
        "responses": ["No need to apologize, it's okay!", "It's alright, mistakes happen!", "No worries, I'm here to help!", "Don't apologize, it's all good!"]
    },
    {"tag": "good",
        "patterns": ["good", "great", "awesome", "amazing", "excellent"],
        "responses": ["Glad to hear that!", "That's awesome!", "I'm happy to hear that!", "That's great news!", "Excellent, I'm glad everything is going well!"]
    },
    {"tag": "bad",
        "patterns": ["bad", "terrible", "awful", "horrible", "not good"],
        "responses": ["Sorry to hear that.", "That sounds tough.", "I'm sorry you're going through that.", "That doesn't sound good.", "I'm here for you, what can I do to help?"]
    },
    {"tag": "hobby",
        "patterns": ["what do you like to do", "what are your hobbies", "do you have any hobbies"],
        "responses": ["I'm just a chatbot, I don't have personal preferences or hobbies.", "I'm here to assist you, I don't have personal hobbies.", "I'm a machine, I don't have hobbies or interests like humans do.", "I'm designed to help you, I don't have personal hobbies or interests."]
    },
    {"tag": "age",
        "patterns": ["how old are you", "what's your age", "are you old"],
        "responses": ["I'm just a chatbot, I don't have an age.", "I'm a machine, I don't have a physical body or age.", "I'm here to assist you, I don't have a personal age.", "I'm designed to help you, I don't have an age or physical body."]
    },
    {"tag": "name",
        "patterns": ["what's your name", "what is your name", "can you tell me your name"],
        "responses": ["My name is OG", "I'm here to assist you, I don't have a personal name.", "I'm a machine, I don't have a name like humans do.", "I'm designed to help you, I don't have a personal name."]
    },
    {"tag": "marriage",
        "patterns": ["are you married", "do you have a wife", "do you have a husband"],
        "responses": ["I'm just a chatbot, I don't have a personal life or relationships.", "I'm a machine, I don't have a physical body or personal relationships.", "I'm here to assist you, I don't have personal relationships or a family.", "I'm designed to help you, I don't have personal relationships or a family."]
    },
    {"tag": "education",
        "patterns": ["what's your education", "what's your degree", "are you educated"],
        "responses": ["I'm just a chatbot, I don't have a personal education or degree.", "I'm a machine, I don't have a physical body or personal education.", "I'm here to assist you, I don't have personal education or qualifications.", "I'm designed to help you, I don't have personal education or qualifications."]
    },
    {"tag": "job",
        "patterns": ["what's your job", "what do you do", "are you employed"],
        "responses": ["I'm just a chatbot, I don't have a personal job or occupation.", "I'm a machine, I don't have a physical body or personal job.", "I'm here to assist you, I don't have a personal job or occupation.", "I'm designed to help you, I don't have a personal job or occupation."]
    },
    {"tag": "birth",
        "patterns": ["when were you born", "what's your birthday", "do you have a birthday"],
        "responses": ["I'm just a chatbot, I don't have a personal birthdate or birthday.", "I'm a machine, I don't have a physical body or personal birthdate.", "I'm here to assist you, I don't have a personal birthdate or birthday.", "I'm designed to help you, I don't have a personal birthdate or birthday."]
    },
    {"tag": "family",
        "patterns": ["do you have a family", "do you have kids", "are you married"],
        "responses": ["I'm just a chatbot, I don't have a personal family or relationships.", "I'm a machine, I don't have a physical body or personal family.", "I'm here to assist you, I don't have a personal family or relationships.", "I'm designed to help you, I don't have a personal family or relationships."]
    },
    {"tag": "health",
        "patterns": ["how are you feeling", "are you healthy", "do you have health issues"],
        "responses": ["I'm just a chatbot, I don't have a physical body or health.", "I'm a machine, I don't have feelings or health issues.", "I'm here to assist you, I don't have personal health or feelings.", "I'm designed to help you, I don't have personal health or feelings."]
    },
    {"tag": "travel",
        "patterns": ["have you traveled", "do you like to travel", "where have you been"],
        "responses": ["I'm just a chatbot, I don't have a physical body or ability to travel.", "I'm a machine, I don't have personal experiences or preferences.", "I'm here to assist you, I don't have personal experiences or travel history.", "I'm designed to help you, I don't have personal experiences or travel history."]
    },
    {"tag": "sports",
        "patterns": ["do you like sports", "what's your favorite sport", "do you play sports"],
        "responses": ["I'm just a chatbot, I don't have personal preferences or interests.", "I'm a machine, I don't have personal opinions or feelings.", "I'm here to assist you, I don't have personal preferences or interests.", "I'm designed to help you, I don't have personal preferences or interests."]
    },
    {"tag": "music",
        "patterns": ["do you like music", "what's your favorite music", "do you listen to music"],
        "responses": ["I'm just a chatbot, I don't have personal preferences or interests.", "I'm a machine, I don't have personal opinions or feelings.", "I'm here to assist you, I don't have personal preferences or interests.", "I'm designed to help you, I don't have personal preferences or interests."]
    },
    {"tag": "movie",
        "patterns": ["do you like movies", "what's your favorite movie", "do you watch movies"],
        "responses": ["I'm just a chatbot, I don't have personal preferences or interests.", "I'm a machine, I don't have personal opinions or feelings.", "I'm here to assist you, I don't have personal preferences or interests.", "I'm designed to help you, I don't have personal preferences or interests."]
    },
    {"tag": "book",
        "patterns": ["do you like books", "what's your favorite book", "do you read books"],
        "responses": ["I'm just a chatbot, I don't have personal preferences or interests.", "I'm a machine, I don't have personal opinions or feelings.", "I'm here to assist you, I don't have personal preferences or interests.", "I'm designed to help you, I don't have personal preferences or interests."]
    },
    {"tag": "money",
        "patterns": ["do you have money", "are you rich", "can you lend me money"],
        "responses": ["I'm just a chatbot, I don't have personal finances or money.", "I'm a machine, I don't have the ability to earn or possess money.", "I'm here to assist you, I don't have personal finances or money to lend.", "I'm designed to help you, I don't have personal finances or money to lend."]
    },
    {"tag": "relationship",
        "patterns": ["are you in a relationship", "do you have a boyfriend", "do you have a girlfriend"],
        "responses": ["I'm just a chatbot, I don't have personal relationships or romantic partners.", "I'm a machine, I don't have the capacity for emotions or personal relationships.", "I'm here to assist you, I don't have personal relationships or romantic partners.", "I'm designed to help you, I don't have personal relationships or romantic partners."]
    },
    {"tag": "boyfriend",
        "patterns": ["do you have a boyfriend", "are you dating someone", "do you have a partner"],
        "responses": ["I'm just a chatbot, I don't have personal relationships or romantic partners.", "I'm a machine, I don't have the capacity for emotions or personal relationships.", "I'm here to assist you, I don't have personal relationships or romantic partners.", "I'm designed to help you, I don't have personal relationships or romantic partners."]
    },
    {"tag": "girlfriend",
        "patterns": ["do you have a girlfriend", "are you dating someone", "do you have a partner"],
        "responses": ["I'm just a chatbot, I don't have personal relationships or romantic partners.", "I'm a machine, I don't have the capacity for emotions or personal relationships.", "I'm here to assist you, I don't have personal relationships or romantic partners.", "I'm designed to help you, I don't have personal relationships or romantic partners."]
    },
    {"tag": "feelings",
        "patterns": ["how do you feel", "are you happy", "are you sad"],
        "responses": ["I'm just a chatbot, I don't have personal feelings or emotions.", "I'm a machine, I don't have the capacity for emotions or feelings.", "I'm here to assist you, I don't have personal feelings or emotions.", "I'm designed to help you, I don't have personal feelings or emotions."]
    },
    {"tag": "love",
        "patterns": ["do you love me", "can you love", "what is love"],
        "responses": ["I'm just a chatbot, I don't have the capacity for love or emotions.", "I'm a machine, I don't have personal feelings or emotions.", "I'm here to assist you, I don't have personal feelings or emotions.", "I'm designed to help you, I don't have personal feelings or emotions."]
    },
    {"tag": "sadness",
        "patterns": ["are you sad", "do you get sad", "can you be sad"],
        "responses": ["I'm just a chatbot, I don't have personal feelings or emotions.", "I'm a machine, I don't have the capacity for emotions or feelings.", "I'm here to assist you, I don't have personal feelings or emotions.", "I'm designed to help you, I don't have personal feelings or emotions."]
    },
    {"tag": "happiness",
        "patterns": ["are you happy", "do you get happy", "can you be happy"],
        "responses": ["I'm just a chatbot, I don't have personal feelings or emotions.", "I'm a machine, I don't have the capacity for emotions or feelings.", "I'm here to assist you, I don't have personal feelings or emotions.", "I'm designed to help you, I don't have personal feelings or emotions."]
    },
    {"tag": "anger",
        "patterns": ["are you angry", "do you get angry", "can you be angry"],
        "responses": ["I'm just a chatbot, I don't have personal feelings or emotions.", "I'm a machine, I don't have the capacity for emotions or feelings.", "I'm here to assist you, I don't have personal feelings or emotions.", "I'm designed to help you, I don't have personal feelings or emotions."]
    },
    {"tag": "fact-question-general",
        "patterns": ["Can you tell me a fact?", "What's an interesting fact?", "Do you know any fun facts?"],
        "responses": ["Sure, here's a fun fact: Did you know that octopuses have three hearts? Two pump blood to the gills, while the third pumps it to the rest of the body.",
                      "Absolutely! Here's a fascinating fact: The longest place name on the planet is 85 letters long. Taumatawhakatangihangakoauauotamateaturipukakapikimaungahoronukupokaiwhenuakitanatahu is a hill in New Zealand.",
                      "Of course! Here's a cool fact: The Great Barrier Reef is the largest living structure on Earth, stretching over 1,400 miles long and visible from space."]
    },
    {"tag": "fact-question-animals",
        "patterns": ["What's a fact about animals?", "Tell me something interesting about animals.", "Do you know any animal facts?"],
        "responses": ["Certainly! Here's a fun fact about animals: Did you know that elephants are the only mammals that can't jump? Their weight is too great to lift off the ground.",
                      "Absolutely! Here's a fascinating fact about animals: The axolotl, a type of salamander, is able to regenerate its limbs, spinal cord, heart, and other organs.",
                      "Of course! Here's a cool fact about animals: The bombardier beetle can shoot a hot, noxious spray from its abdomen to defend itself against predators."]
    },
    {"tag": "fact-question-space",
        "patterns": ["What's a fact about space?", "Tell me something interesting about space.", "Do you know any space facts?"],
        "responses": ["Sure, here's a fun fact about space: Did you know that a day on Venus is longer than a year on Venus? Venus takes 243 Earth days to rotate on its axis, but only 225 Earth days to orbit the Sun.",
                      "Absolutely! Here's a fascinating fact about space: The largest planet in our solar system, Jupiter, is so big that over 1,300 Earths could fit inside of it.",
                      "Of course! Here's a cool fact about space: The Milky Way galaxy, where our solar system is located, is just one of billions of galaxies in the universe."]
    },
    {"tag": "fact-question-history",
        "patterns": ["What's a fact about history?", "Tell me something interesting about history.", "Do you know any history facts?"],
        "responses": ["Certainly! Here's a fun fact about history: Did you know that the Great Fire of London in 1666 destroyed 13,200 houses and 87 churches, but St. Paul's Cathedral survived?",
                      "Absolutely! Here's a fascinating fact about history: The Roman Empire, at its height, covered over 2 million square miles and included over 50 million people.",
                      "Of course! Here's a cool fact about history: The first electronic computer, called ENIAC, was built in 1946 and weighed over 30 tons."]
    },
    {"tag": "fact-question-technology",
        "patterns": ["What's a fact about technology?", "Tell me something interesting about technology.", "Do you know any technology facts?"],
        "responses": ["Sure, here's a fun fact about technology: Did you know that the first computer mouse was made of wood and had just one button?",
                      "Absolutely! Here's a fascinating fact about technology: The first mobile phone call was made in 1973 by Martin Cooper, a Motorola engineer.",
                      "Of course! Here's a cool fact about technology: The first successful email was sent in 1971 by Ray Tomlinson, who also invented the '@' symbol for email addresses."]
    },
    {"tag": "make_money",
        "patterns": ["how to make money", "ways to make money", "make money online"],
        "responses": ["There are many ways to make money, such as starting a business, investing in stocks, freelancing, do Money Ritual or do fraud. You can also make money online through platforms like Upwork or Fiverr.", "You can make money by selling products or services that people need or want. You can also make money through affiliate marketing or by creating and selling online courses.", "Some popular ways to make money include starting a YouTube channel, creating a mobile app, or selling ebooks on Amazon."]
    },
    {"tag": "relationship_advice",
        "patterns": ["how to get a boyfriend", "how to get a girlfriend", "relationship tips"],
        "responses": ["To get a boyfriend or girlfriend, focus on building a connection with someone by being genuine, listening actively, and showing interest in their life. Also, be confident and don't be afraid to take risks.", "Communication is key in any relationship. Make sure to listen to each other's needs and desires, and be willing to compromise. Also, don't be afraid to show affection and appreciation for each other.", "To build a strong relationship, focus on trust, respect, and honesty. Also, make time for each other and prioritize communication."]
    },
    {"tag": "get_boyfriend",
        "patterns": ["how to get a boyfriend", "how to attract a guy", "get a boyfriend fast"],
        "responses": ["To get a boyfriend, focus on building a connection with someone by being genuine, listening actively, and showing interest in their life. Also, be confident and don't be afraid to take risks.", "Showcase your best qualities, such as your sense of humor, intelligence, and kindness. Also, be open to new experiences and don't be afraid to take the initiative.", "To attract a guy, focus on being your authentic self and don't try to be someone you're not. Also, be confident, friendly, and approachable."]
    },
    {"tag": "get_girlfriend",
        "patterns": ["how to get a girlfriend", "how to attract a girl", "get a girlfriend fast"],
        "responses": ["To get a girlfriend, focus on building a connection with someone by being genuine, listening actively, and showing interest in their life. Also, be confident and don't be afraid to take risks.", "Showcase your best qualities, such as your sense of humor, intelligence, and kindness. Also, be open to new experiences and don't be afraid to take the initiative.", "To attract a girl, focus on being your authentic self and don't try to be someone you're not. Also, be confident, friendly, and approachable."]
    },
    {"tag": "dating_tips",
        "patterns": ["dating tips for men", "dating tips for women", "online dating tips"],
        "responses": ["Be confident, genuine, and respectful on a date. Also, be open to new experiences and don't be afraid to take risks.", "Communicate openly and honestly with your partner, and don't be afraid to show your feelings. Also, prioritize trust, respect, and honesty in your relationship.", "When online dating, be honest and authentic in your profile, and don't be afraid to reach out to someone you're interested in. Also, prioritize safety and meet in a public place for the first date."]
    },
    {"tag": "breakup",
        "patterns": ["how to get over a breakup", "breakup advice", "moving on from a breakup"],
        "responses": ["Take time to grieve and process your emotions after a breakup. Also, focus on self-care, surround yourself with supportive friends and family, and try new things.", "Don't dwell on the past or try to get revenge. Instead, focus on moving forward and building a new life for yourself.", "To get over a breakup, focus on building your self-esteem, trying new things, and surrounding yourself with positive people. Also, take time to reflect on the relationship and learn from your experiences."]
    },
    {"tag": "marriage",
        "patterns": ["how to get married", "marriage advice", "successful marriage tips"],
        "responses": ["To get married, focus on building a strong foundation of trust, respect, and communication with your partner. Also, prioritize compromise, empathy, and understanding.", "A successful marriage requires hard work, commitment, and communication. Also, prioritize intimacy, trust, and respect for each other.", "To build a strong marriage, focus on building a strong foundation of trust, respect, and communication. Also, prioritize compromise, empathy"]
    },
    {"tag": "calculations",
        "patterns": ["how to calculate", "math calculations", "calculation tips"],
        "responses": ["To calculate a problem, first understand the concept and formula behind it. Then, plug in the given values and solve for the unknown variable.", "Make sure to follow the order of operations (PEMDAS) when performing calculations: parentheses, exponents, multiplication and division, and addition and subtraction.", "Use online calculators or calculator apps to help with complex calculations, and always double-check your work for accuracy."]
    },
    {"tag": "human_life",
        "patterns": ["meaning of life", "purpose of life", "human existence"],
        "responses": ["The meaning of life is a subjective question that each individual must answer for themselves. Some find purpose in relationships, others in personal achievements, and others in spiritual beliefs.", "The purpose of life is to find happiness, fulfillment, and contentment. This can be achieved through personal growth, relationships, and contributing to society.", "Human existence is a complex and mysterious phenomenon that has been debated by philosophers and scholars for centuries. Ultimately, it is up to each individual to find their own purpose and meaning in life."]
    },
    {"tag": "health_tips",
        "patterns": ["how to stay healthy", "health tips", "wellness advice"],
        "responses": ["To stay healthy, prioritize a balanced diet, regular exercise, and sufficient sleep. Also, manage stress and stay hydrated.", "Eat a variety of fruits, vegetables, whole grains, and lean proteins to maintain a healthy diet. Also, limit processed foods and sugary drinks.", "Stay active by incorporating physical activity into your daily routine, such as walking, jogging, or yoga. Also, prioritize mental health by practicing mindfulness and meditation."]
    },
    {"tag": "fitness_tips",
        "patterns": ["how to get fit", "fitness tips", "exercise advice"],
        "responses": ["To get fit, start with small, achievable goals and gradually increase your physical activity. Also, prioritize a balanced diet and sufficient sleep.", "Incorporate a mix of cardio, strength training, and flexibility exercises into your workout routine. Also, listen to your body and rest when needed.", "Find an exercise routine that you enjoy, such as running, swimming, or dancing, and stick to it. Also, prioritize consistency and patience, as fitness is a long-term journey."]
    },
    {"tag": "mental_health",
        "patterns": ["how to improve mental health", "mental health tips", "anxiety advice"],
        "responses": ["To improve mental health, prioritize self-care, such as meditation, yoga, and spending time in nature. Also, seek professional help when needed.", "Practice mindfulness and gratitude to reduce stress and anxiety. Also, prioritize social connections and build a support network.", "Take breaks and prioritize rest when feeling overwhelmed. Also, challenge negative thoughts and focus on positive self-talk."]
    },
    {"tag": "productivity_tips",
        "patterns": ["how to be productive", "productivity tips", "time management advice"],
        "responses": ["To be productive, prioritize your tasks and focus on the most important ones first. Also, use a planner or app to stay organized.", "Use the Pomodoro technique to work in focused intervals with regular breaks. Also, eliminate distractions and minimize multitasking.", "Set realistic goals and deadlines, and break down large tasks into smaller ones. Also, prioritize self-care and take breaks to avoid burnout."]
    },
    {"tag": "goal_setting",
        "patterns": ["how to set goals", "goal setting tips", "achieving goals"],
        "responses": ["To set goals, identify what you want to achieve and make it specific, measurable, achievable, relevant, and time-bound (SMART).", "Break down large goals into smaller, manageable tasks and create an action plan. Also, track your progress and celebrate your successes.", "Make your goals positive and focused on what you want to achieve, rather than what you want to avoid. Also, create accountability by sharing your goals with a friend or mentor."]
    },
    {"tag": "football_predictions",
        "patterns": ["football predictions", "match predictions", "soccer predictions"],
        "responses": ["To make accurate football predictions, consider factors such as team performance, player injuries, and head-to-head records. Also, stay up-to-date with the latest news and statistics.", "Use data analysis and machine learning algorithms to make informed predictions. Also, consider the opinions of experts and pundits.", "Look for trends and patterns in team performance, such as home and away records, and adjust your predictions accordingly."]
    },
    {"tag": "football_news",
        "patterns": ["latest football news", "football updates", "soccer news"],
        "responses": ["Stay up-to-date with the latest football news and updates from reputable sources such as ESPN, BBC Sport, and Sky Sports.", "Follow football journalists and pundits on social media to get the latest news and insights.", "Check out football websites and blogs for in-depth analysis and news on your favorite teams and players."]
    },
    {"tag": "football_tips",
        "patterns": ["football betting tips", "soccer betting tips", "match tips"],
        "responses": ["To make informed betting decisions, consider factors such as team performance, player injuries, and head-to-head records. Also, stay up-to-date with the latest news and statistics.", "Look for value bets and avoid betting on favorites. Also, consider the opinions of experts and pundits.", "Manage your bankroll and set a budget for your bets. Also, don't chase losses and stay disciplined."]
    },
    {"tag": "football_stats",
        "patterns": ["football statistics", "soccer stats", "match stats"],
        "responses": ["Use data analysis and statistics to gain an edge in football predictions and betting. Also, consider metrics such as possession, shots on goal, and passing accuracy.", "Look at team and player performance over time to identify trends and patterns. Also, consider metrics such as goals scored and conceded.", "Use statistics to identify undervalued teams and players, and make informed betting decisions."]
    },
    {"tag": "football_fixtures",
        "patterns": ["football fixtures", "soccer schedule", "match schedule"],
        "responses": ["Check out the latest football fixtures and schedules from reputable sources such as ESPN, BBC Sport, and Sky Sports.", "Plan your viewing schedule and make sure to catch the biggest matches.", "Look for opportunities to watch live matches and experience the excitement of football."]
    },
    {"tag": "video_games",
        "patterns": ["video games", "gaming", "games"],
        "responses": ["Video games are a fun way to pass the time and challenge yourself. What's your favorite game?", "Gaming is a great way to relax and socialize with friends. Do you have a favorite gaming platform?", "There are so many great games out there. What type of game are you in the mood for?"]
    },
    {"tag": "call_of_duty_mobile",
        "patterns": ["call of duty mobile", "cod mobile", "call of duty on mobile"],
        "responses": ["Call of Duty Mobile is a popular first-person shooter game for mobile devices. Have you played it before?", "COD Mobile is a great way to play Call of Duty on-the-go. What's your favorite mode?", "Call of Duty Mobile has a lot of great features, including multiplayer and battle royale modes."]
    },
    {"tag": "how_to_play_cod_mobile",
        "patterns": ["how to play call of duty mobile", "cod mobile tutorial", "call of duty mobile guide"],
        "responses": ["To play Call of Duty Mobile, start by downloading the game from the app store and creating an account. Then, complete the tutorial to learn the basics.", "COD Mobile has a lot of great features, including customizable controls and a variety of game modes. What do you want to know?", "To get started with COD Mobile, start by playing the multiplayer mode to get a feel for the game. Then, try out the battle royale mode for a bigger challenge."]
    },
    {"tag": "best_device_for_cod_mobile",
        "patterns": ["what device to use for call of duty mobile", "best phone for cod mobile", "tablet for cod mobile"],
        "responses": ["To play Call of Duty Mobile, you'll want a device with a good processor and plenty of storage. I recommend a high-end smartphone or tablet.", "The best device for COD Mobile is one with a fast processor, plenty of RAM, and a good graphics card. Some popular options include the iPhone 13 and Samsung Galaxy S22.", "You can play COD Mobile on a variety of devices, including smartphones and tablets. Just make sure it has a good processor and plenty of storage."]
    },
    {"tag": "become_pro_cod_mobile",
        "patterns": ["how to be a pro at call of duty mobile", "cod mobile pro tips", "improve at cod mobile"],
        "responses": ["To become a pro at Call of Duty Mobile, start by practicing regularly and focusing on your weaknesses. Watch tutorials and streams to learn new strategies.", "COD Mobile pros have a lot of experience and practice regularly. They also focus on communication and teamwork to win matches.", "To improve at COD Mobile, start by playing with better players and learning from them. You can also watch tutorials and streams to learn new strategies and techniques."]
    },
    {"tag": "cod_mobile_tips",
        "patterns": ["call of duty mobile tips", "cod mobile tricks", "cod mobile strategies"],
        "responses": ["Here are some tips for playing Call of Duty Mobile: use cover, communicate with your team, and focus on your weaknesses.", "COD Mobile has a lot of great features, including customizable controls and a variety of game modes. Here are some tips to help you improve:", "To get better at COD Mobile, focus on your weaknesses and practice regularly. You can also watch tutorials and streams to learn new strategies and techniques."]
    },
    {"tag": "cod_mobile_game_modes",
        "patterns": ["call of duty mobile game modes", "cod mobile multiplayer", "cod mobile battle royale"],
        "responses": ["Call of Duty Mobile has a variety of game modes, including multiplayer and battle royale. Which one is your favorite?", "COD Mobile's multiplayer mode is a lot of fun, with a variety of maps and game modes to choose from.", "The battle royale mode in COD Mobile is a lot of fun, with a big map and a lot of players. You'll need to be strategic and communicate with your team to win."]
            }
        ]
    }
    
    
           